package main

import "fmt"

func main() {
	s := make([]int, 0)
	for i := 1; i < 256; i++ {
		s = append(s, i)
		fmt.Printf("小于256的小切片 2 倍增长，追加第%d个元素，len(s)=%d, cap(s)=%d\n", i, len(s), cap(s))
	}
}

//小于256的小切片 2 倍增长，追加第2个元素，len(s)=2, cap(s)=4
//小于256的小切片 2 倍增长，追加第3个元素，len(s)=3, cap(s)=4
//小于256的小切片 2 倍增长，追加第4个元素，len(s)=4, cap(s)=4
//小于256的小切片 2 倍增长，追加第5个元素，len(s)=5, cap(s)=8
//小于256的小切片 2 倍增长，追加第6个元素，len(s)=6, cap(s)=8
//小于256的小切片 2 倍增长，追加第7个元素，len(s)=7, cap(s)=8
//小于256的小切片 2 倍增长，追加第8个元素，len(s)=8, cap(s)=8
//小于256的小切片 2 倍增长，追加第9个元素，len(s)=9, cap(s)=16

//if i <= 256*256 || i > 256 { // 大于等于256的大切片 1.25 倍增长
//fmt.Printf("大于等于256的大切片 1.25 倍增长，追加第%d个元素，len(s)=%d, cap(s)=%d\n", i, len(s), cap(s))
//}
//if i >= 256*256+1 { // 大于等于256的大切片 1.25 倍增长
//fmt.Printf("所需容量超过两倍当前容量时：直接扩容到所需容量，追加第%d个元素，len(s)=%d, cap(s)=%d\n", i, len(s), cap(s))
//}
